RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_tmr.c
    if (PWMConfig->polarity == TMR_IC_POLARITY_RISING)
    {
        icpolarity = TMR_IC_POLARITY_FALLING;
    }
    else
    {
        icpolarity = TMR_IC_POLARITY_RISING;
    }

    if (PWMConfig->selection == TMR_IC_SELECTION_DIRECT_TI)
    {
        icselection = TMR_IC_SELECTION_INDIRECT_TI;
    }
    else
    {
        icselection = TMR_IC_SELECTION_DIRECT_TI;
    }

    if (PWMConfig->channel == TMR_CHANNEL_1)
    {
        TI1Config(tmr, PWMConfig->polarity, PWMConfig->selection, PWMConfig->filter);
        TMR_ConfigIC1Prescaler(tmr, PWMConfig->prescaler);
        TI2Config(tmr, icpolarity, icselection, PWMConfig->filter);
        TMR_ConfigIC2Prescaler(tmr, PWMConfig->prescaler);
    }
    else
    {
        TI2Config(tmr, PWMConfig->polarity, PWMConfig->selection, PWMConfig->filter);
        TMR_ConfigIC2Prescaler(tmr, PWMConfig->prescaler);
        TI1Config(tmr, icpolarity, icselection, PWMConfig->filter);
        TMR_ConfigIC1Prescaler(tmr, PWMConfig->prescaler);
    }
}

/*!
 * @brief     Read Input Capture 1 value.
 *
 * @param     tmr: The TMRx can be 1 to 14 except 6 and 7
 *
 * @retval    Capture Compare 1 Register value.
 */
uint32_t TMR_ReadCaputer1(TMR_T *tmr)
{
    return tmr->CC1;
}

/*!
 * @brief     Read Input Capture 2 value.
 *
 * @param     tmr: The TMRx can be 1 to 12 except 6 7 10 and 11
 *
 * @retval    Capture Compare 2 Register value.
 */
uint32_t TMR_ReadCaputer2(TMR_T *tmr)
{
    return tmr->CC2;
}

/*!
 * @brief     Read Input Capture 3 value.
 *
 * @param     tmr: The TMRx can be 1 to 8 except 6 and 7
 *
 * @retval    Capture Compare 3 Register value.
 */
uint32_t TMR_ReadCaputer3(TMR_T *tmr)
{
    return tmr->CC3;
}

/*!
 * @brief     Read Input Capture 4 value.
 *
 * @param     tmr: The TMRx can be 1 to 8 except 6 and 7
 *
 * @retval    Capture Compare 4 Register value.
 */
uint32_t TMR_ReadCaputer4(TMR_T *tmr)
{
    return tmr->CC4;
}

/*!
 * @brief     Configs the TMRx Input Capture 1 prescaler.
 *
 * @param     tmr: The TMRx can be 1 to 14 except 6 and 7
 *
 * @param     prescaler: specifies the Input Capture Channel 1 Perscaler
 *                       The parameter can be one of following values:
 *                       @arg TMR_IC_PSC_1: no prescaler
 *                       @arg TMR_IC_PSC_2: capture is done once every 2 events
 *                       @arg TMR_IC_PSC_4: capture is done once every 4 events
 *                       @arg TMR_IC_PSC_8: capture is done once every 8 events
 *
 * @retval    None
 */
void TMR_ConfigIC1Prescaler(TMR_T *tmr, TMR_IC_PSC_T prescaler)
{
    tmr->CCM1_CAPTURE_B.IC1PSC = prescaler;
}
/*!
 * @brief     Sets the TMRx Input Capture 2 prescaler.
 *
 * @param     tmr: The TMRx can be 1 to 12 except 6 7 10 and 11
 *
 * @param     prescaler: specifies the Input Capture Channel 2 Perscaler
 *                       The parameter can be one of following values:
 *                       @arg TMR_IC_PSC_1: no prescaler
 *                       @arg TMR_IC_PSC_2: capture is done once every 2 events
 *                       @arg TMR_IC_PSC_4: capture is done once every 4 events
 *                       @arg TMR_IC_PSC_8: capture is done once every 8 events
 *
 * @retval    None
 */
void TMR_ConfigIC2Prescaler(TMR_T *tmr, TMR_IC_PSC_T prescaler)
{
    tmr->CCM1_CAPTURE_B.IC2PSC = prescaler;
}

/*!
 * @brief     Configs the TMRx Input Capture 3 prescaler.
 *
 * @param     tmr: The TMRx can be 1 to 8 except 6 and 7
 *
 * @param     prescaler: specifies the Input Capture Channel 3 Perscaler
 *                       The parameter can be one of following values:
 *                       @arg TMR_IC_PSC_1: no prescaler
 *                       @arg TMR_IC_PSC_2: capture is done once every 2 events
 *                       @arg TMR_IC_PSC_4: capture is done once every 4 events
 *                       @arg TMR_IC_PSC_8: capture is done once every 8 events
 *
 * @retval    None
 */
void TMR_ConfigIC3Prescaler(TMR_T *tmr, TMR_IC_PSC_T prescaler)
{
    tmr->CCM2_CAPTURE_B.IC3PSC = prescaler;
}

/*!
 * @brief     Configs the TMRx Input Capture 4 prescaler.
 *
 * @param     tmr: The TMRx can be 1 to 8 except 6 and 7
 *
 * @param     prescaler: specifies the Input Capture Channel4 Perscaler
 *                       The parameter can be one of following values:
 *                       @arg TMR_IC_PSC_1: no prescaler
 *                       @arg TMR_IC_PSC_2: capture is done once every 2 events
 *                       @arg TMR_IC_PSC_4: capture is done once every 4 events
 *                       @arg TMR_IC_PSC_8: capture is done once every 8 events
 *
 * @retval    None
 */
void TMR_ConfigIC4Prescaler(TMR_T *tmr, TMR_IC_PSC_T prescaler)
{
    tmr->CCM2_CAPTURE_B.IC4PSC = prescaler;
}

/*!
 * @brief     Configures the: Break feature, dead time, Lock level, the IMOS
 *
 * @param     tmr: The TMRx can be 1 or 8
 *
 * @param     BDTConfig: Pointer to a TMR_BDTConfig_T structure
 *
 * @retval    None
 */
void TMR_ConfigBDT(TMR_T *tmr, TMR_BDTConfig_T *BDTConfig)
{
    tmr->BDT = (BDTConfig->IMOS) << 10 | \
               (BDTConfig->RMOS) << 11 | \
               (BDTConfig->lockLevel) << 8 | \
               (BDTConfig->deadTime) | \
               (BDTConfig->BRKState) << 12 | \
               (BDTConfig->BRKPolarity) << 13 | \
               (BDTConfig->automaticOutput) << 14;
}

/*!
 * @brief     Initialize the BDT timer with its default value.
 *
 * @param     BDTConfig: pointer to a TMR_BDTConfig_T
 *
 * @retval    None
 */
void TMR_ConfigBDTStructInit(TMR_BDTConfig_T *BDTConfig)
{
    BDTConfig->RMOS = TMR_RMOS_STATE_DISABLE;
    BDTConfig->IMOS = TMR_IMOS_STATE_DISABLE;
    BDTConfig->lockLevel = TMR_LOCK_LEVEL_OFF;
    BDTConfig->deadTime = 0x00;
    BDTConfig->BRKState = TMR_BRK_STATE_DISABLE;
    BDTConfig->BRKPolarity = TMR_BRK_POLARITY_LOW;
    BDTConfig->automaticOutput = TMR_AUTOMATIC_OUTPUT_DISABLE;
}

/*!
 * @brief     Enable TMRx PWM output
 *
 * @param     tmr: The TMRx it can be TMR1 and TMR8
 *
 * @retval    None
 */
void TMR_EnablePWMOutputs(TMR_T *tmr)
{
    tmr->BDT_B.MOEN = ENABLE;
}

/*!
 * @brief     Disable TMRx PWM output.
 *
 * @param     tmr: The TMRx it can be TMR1 and TMR8
 *
 * @retval    None
 */
void TMR_DisablePWMOutputs(TMR_T *tmr)
{
    tmr->BDT_B.MOEN = DISABLE;
}

/*!
 * @brief     Enable to Select the TMR peripheral Commutation event.
 *
 * @param     tmr: The TMRx it can be TMR1 and TMR8
 *
 * @retval    None
 */
void TMR_EnableSelectCOM(TMR_T *tmr)
{
    tmr->CTRL2_B.CCUSEL = ENABLE;
}
/*!
 * @brief     Disable to Select the TMR peripheral Commutation event.
 *
 * @param     tmr: The TMRx it can be TMR1 and TMR8
 *
 * @retval    None
 */
void TMR_DisableSelectCOM(TMR_T *tmr)
{
    tmr->CTRL2_B.CCUSEL = DISABLE;
}

/*!
 * @brief     Enable Capture Compare Preload Control bit.
 *
 * @param     tmr: The TMRx can be 1 to 8 except 6 and 7
 *
 * @retval    None
 */
void TMR_EnableCCPreload(TMR_T *tmr)
{
    tmr->CTRL2_B.CCPEN = ENABLE;
}

/*!
 * @brief     Disable Capture Compare Preload Control bit.
 *
 * @param     tmr: The TMRx can be 1 to 8 except 6 and 7
 *
 * @retval    None
 */
void TMR_DisableCCPreload(TMR_T *tmr)
{
    tmr->CTRL2_B.CCPEN = DISABLE;
}

/*!
 * @brief     Configures the TMRx's DMA interface.
 *
 * @param     tmr: The TMRx can be 1 to 8 except 6 and 7
 *
 * @param     baseAddress: DMA Base address.
 *                         This parameter can be one of the following values:
 *                         @arg TMR_DMA_BASE_CTRL1
 *                         @arg TMR_DMA_BASE_CTRL2
 *                         @arg TMR_DMA_BASE_SMCTRL
 *                         @arg TMR_DMA_BASE_DIEN
 *                         @arg TMR_DMA_BASE_STS
 *                         @arg TMR_DMA_BASE_CEG
 *                         @arg TMR_DMA_BASE_CCM1
 *                         @arg TMR_DMA_BASE_CCM2
 *                         @arg TMR_DMA_BASE_CCEN
 *                         @arg TMR_DMA_BASE_CNT
 *                         @arg TMR_DMA_BASE_PSC
 *                         @arg TMR_DMA_BASE_AUTORLD
 *                         @arg TMR_DMA_BASE_REPCNT
 *                         @arg TMR_DMA_BASE_CC1
 *                         @arg TMR_DMA_BASE_CC2
 *                         @arg TMR_DMA_BASE_CC3
 *                         @arg TMR_DMA_BASE_CC4
 *                         @arg TMR_DMA_BASE_BDT
 *                         @arg TMR_DMA_BASE_DCTRL
 *
 * @param     burstLength: DMA Burst length. This parameter can be one value
 *            between: TMR_DMA_BURSTLENGTH_1TRANSFER and TMR_DMA_BURSTLENGTH_18TRANSFERS.
 *
 * @retval    None
 */
void TMR_ConfigDMA(TMR_T *tmr, TMR_DMA_BASE_T baseAddress, TMR_DMA_BURSTLENGTH_T burstLength)
{
    tmr->DCTRL = (uint32_t)baseAddress | (uint32_t)burstLength;
}

/*!
 * @brief     Enable TMRx Requests.
 *
 * @param     tmr: The TMRx can be 1 to 8
 *
 * @param     dmaSource: specifies the TMR DMA souces
 *                      The parameter can be any combination of following values:
 *                      @arg TMR_DMA_SOURCE_UPDATE: TMR update DMA souces
 *                      @arg TMR_DMA_SOURCE_CH1:    TMR Capture Compare 1 DMA souces
 *                      @arg TMR_DMA_SOURCE_CH2:    TMR Capture Compare 2 DMA souces
 *                      @arg TMR_DMA_SOURCE_CH3:    TMR Capture Compare 3 DMA souces
 *                      @arg TMR_DMA_SOURCE_CH4:    TMR Capture Compare 4 DMA souces
 *                      @arg TMR_DMA_SOURCE_COM:    TMR Commutation DMA souces
 *                      @arg TMR_DMA_SOURCE_TRG:    TMR Trigger DMA souces
 *
 * @retval    None
 *
 * @note
 */
void TMR_EnableDMASoure(TMR_T *tmr, uint16_t dmaSource)
{
    tmr->DIEN |= dmaSource;
}

/*!
 * @brief     Disable TMRx Requests.
 *
 * @param     tmr: The TMRx can be 1 to 8
 *
 * @param     dmaSource: specifies the TMR DMA souces
 *                       The parameter can be any combination of following values:
 *                       @arg TMR_DMA_SOURCE_UPDATE: TMR update DMA souces
 *                       @arg TMR_DMA_SOURCE_CH1:    TMR Capture Compare 1 DMA souces
 *                       @arg TMR_DMA_SOURCE_CH2:    TMR Capture Compare 2 DMA souces
 *                       @arg TMR_DMA_SOURCE_CH3:    TMR Capture Compare 3 DMA souces
 *                       @arg TMR_DMA_SOURCE_CH4:    TMR Capture Compare 4 DMA souces
 *                       @arg TMR_DMA_SOURCE_COM:    TMR Commutation DMA souces
 *                       @arg TMR_DMA_SOURCE_TRG:    TMR Trigger DMA souces
 *
 * @retval    None
 *
 * @note
 */
void TMR_DisableDMASoure(TMR_T *tmr, uint16_t dmaSource)
{
    tmr->DIEN &= ~dmaSource;
}

/*!
 * @brief     Enable Capture Compare DMA source.
 *
 * @param     tmr: The TMRx can be 1 to 8 except 6 and 7
 *
 * @retval    None
 */
void TMR_EnableCCDMA(TMR_T *tmr)
{
    tmr->CTRL2_B.CCDSEL = ENABLE;
}

/*!
 * @brief     Disable Capture Compare DMA source.
 *
 * @param     tmr: The TMRx can be 1 to 8 except 6 and 7
 *
 * @retval    None
 */
void TMR_DisableCCDMA(TMR_T *tmr)
{
    tmr->CTRL2_B.CCDSEL = DISABLE;
}

/*!
 * @brief     Configures the TMRx internal Clock
 *
 * @param     tmr: The TMRx can be 1 to 12 except 6 7 10 and 11
 *
 * @retval    None
 */
void TMR_ConfigInternalClock(TMR_T *tmr)
{
    tmr->SMCTRL_B.SMFSEL = BIT_RESET;
}

/*!
 * @brief     Configures the TMRx Internal Trigger as External Clock
 *
 * @param     tmr: The TMRx can be 1 to 12 except 6 7 10 and 11
 *
 * @param     triggerSource: specifies the TMR trigger souces
 *                           The parameter can be one of following values:
 *                           @arg TMR_TRIGGER_SOURCE_ITR0: TMR Internal Trigger 0
 *                           @arg TMR_TRIGGER_SOURCE_ITR1: TMR Internal Trigger 1
 *                           @arg TMR_TRIGGER_SOURCE_ITR2: TMR Internal Trigger 2
 *                           @arg TMR_TRIGGER_SOURCE_ITR3: TMR Internal Trigger 3
 *
 * @retval    None
 */
void TMR_ConfigIntTrigExternalClock(TMR_T *tmr, TMR_TRIGGER_SOURCE_T triggerSource)
{
    TMR_SelectInputTrigger(tmr, triggerSource);
    tmr->SMCTRL_B.SMFSEL = TMR_SLAVE_MODE_EXTERNAL1;
}

/*!
 * @brief     Configures the TMRx  Trigger as External Clock
 *
 * @param     tmr: The TMRx can be 1 to 14 except 6 and 7
 *
 * @param     triggerSource: specifies the TMR trigger souces
 *                           The parameter can be one of following values:
 *                           @arg TMR_TRIGGER_SOURCE_TI1F_ED:  TI1 Edge Detector
 *                           @arg TMR_TRIGGER_SOURCE_TI1FP1:   Filtered Timer Input 1
 *                           @arg TMR_TRIGGER_SOURCE_TI2FP2:   Filtered Timer Input 2
 *
 * @param     ICpolarity: specifies the TMR IC polarity
 *                        The parameter can be one of following values:
 *                        @arg TMR_IC_POLARITY_RISING:  TMR IC polarity rising
 *                        @arg TMR_IC_POLARITY_FALLING: TMR IC polarity falling
 *
 * @param     ICfilter: This parameter must be a value between 0x00 and 0x0F.
 *
 * @retval    None
 */
void TMR_ConfigTrigExternalClock(TMR_T *tmr, TMR_TRIGGER_SOURCE_T triggerSource,
                                 TMR_IC_POLARITY_T ICpolarity, uint16_t ICfilter)
{
    if (triggerSource == TMR_TRIGGER_SOURCE_TI2FP2)
    {
        TI2Config(tmr, ICpolarity, TMR_IC_SELECTION_DIRECT_TI, ICfilter);
    }
    else
    {
        TI1Config(tmr, ICpolarity, TMR_IC_SELECTION_DIRECT_TI, ICfilter);
    }

