RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_tmr.c
    TMR_SelectInputTrigger(tmr, triggerSource);
    tmr->SMCTRL_B.SMFSEL = 0x07;
}

/*!
 * @brief     Configures the External clock Mode1
 *
 * @param     tmr: The TMRx can be 1 to 8 except 6 and 7
 *
 * @param     prescaler: specifies the external Trigger Prescaler
 *                       The parameter can be one of following values:
 *                       @arg TMR_EXTTRG_PSC_OFF:  ETRP Prescaler OFF
 *                       @arg TMR_EXTTRG_PSC_DIV2: ETRP frequency divided by 2
 *                       @arg TMR_EXTTRG_PSC_DIV4: ETRP frequency divided by 4
 *                       @arg TMR_EXTTRG_PSC_DIV8: ETRP frequency divided by 8
 *
 * @param     polarity: specifies the TMR IC polarity
 *                      The parameter can be one of following values:
 *                      @arg TMR_EXTTRG_POL_INVERTED:  Active low or falling edge active
 *                      @arg TMR_EXTTGR_POL_NONINVERTED: Active high or rising edge active
 *
 * @param     filter: This parameter must be a value between 0x00 and 0x0F.
 *
 * @retval    None
 */
void TMR_ConfigETRClockMode1(TMR_T *tmr, TMR_EXTTRG_PSC_T prescaler,
                             TMR_EXTTRG_POL_T polarity, uint16_t filter)
{
    TMR_ConfigETR(tmr, prescaler, polarity, filter);

    tmr->SMCTRL_B.SMFSEL = TMR_SLAVE_MODE_EXTERNAL1;
    tmr->SMCTRL_B.TRGSEL = TMR_TRIGGER_SOURCE_ETRF;
}

/*!
 * @brief     Configures the External clock Mode2
 *
 * @param     tmr: The TMRx can be 1 to 8 except 6 and 7
 *
 * @param     prescaler: specifies the external Trigger Prescaler
 *                       The parameter can be one of following values:
 *                       @arg TMR_EXTTRG_PSC_OFF:  ETRP Prescaler OFF
 *                       @arg TMR_EXTTRG_PSC_DIV2: ETRP frequency divided by 2
 *                       @arg TMR_EXTTRG_PSC_DIV4: ETRP frequency divided by 4
 *                       @arg TMR_EXTTRG_PSC_DIV8: ETRP frequency divided by 8
 *
 * @param     polarity: specifies the TMR IC polarity
 *                      The parameter can be one of following values:
 *                      @arg TMR_EXTTRG_POL_INVERTED:  Active low or falling edge active
 *                      @arg TMR_EXTTGR_POL_NONINVERTED: Active high or rising edge active
 *
 * @param     filter: This parameter must be a value between 0x00 and 0x0F.
 *
 * @retval    None
 */
void TMR_ConfigETRClockMode2(TMR_T *tmr, TMR_EXTTRG_PSC_T prescaler,
                             TMR_EXTTRG_POL_T polarity, uint16_t filter)
{
    TMR_ConfigETR(tmr, prescaler, polarity, filter);

    tmr->SMCTRL_B.ECEN = ENABLE;
}

/*!
 * @brief     Selects the Input Trigger source
 *
 * @param     tmr: The TMRx can be 1 to 14 except 6 and 7
 *
 * @param     triggerSource: specifies the Input Trigger source
 *                           The parameter can be one of following values:
 *                           @arg TMR_TRIGGER_SOURCE_ITR0: Internal Trigger 0
 *                           @arg TMR_TRIGGER_SOURCE_ITR1: Internal Trigger 1
 *                           @arg TMR_TRIGGER_SOURCE_ITR2: Internal Trigger 2
 *                           @arg TMR_TRIGGER_SOURCE_ITR3: Internal Trigger 3
 *                           @arg TMR_TRIGGER_SOURCE_TI1F_ED: TI1 Edge Detector
 *                           @arg TMR_TRIGGER_SOURCE_TI1FP1: Filtered Timer Input 1
 *                           @arg TMR_TRIGGER_SOURCE_TI2FP2: Filtered Timer Input 2
 *                           @arg TMR_TRIGGER_SOURCE_ETRF: External Trigger input
 *
 * @retval    None
 */
void TMR_SelectInputTrigger(TMR_T *tmr, TMR_TRIGGER_SOURCE_T triggerSource)
{
    tmr->SMCTRL_B.TRGSEL = triggerSource;
}

/*!
 * @brief     Selects the Trigger Output Mode.
 *
 * @param     tmr: The TMRx can be 1 to 8
 *
 * @param     TRGOSource: specifies the Trigger Output source
 *                       The parameter can be one of following values:
 *                        @arg TMR_TRGO_SOURCE_RESET
 *                        @arg TMR_TRGO_SOURCE_ENABLE
 *                        @arg TMR_TRGO_SOURCE_UPDATE
 *                       The under parameters are not for TMR6 and TMR7:
 *                        @arg TMR_TRGO_SOURCE_OC1
 *                        @arg TMR_TRGO_SOURCE_OC1REF
 *                        @arg TMR_TRGO_SOURCE_OC2REF
 *                        @arg TMR_TRGO_SOURCE_OC3REF
 *                        @arg TMR_TRGO_SOURCE_OC4REF
 *
 * @retval    None
 */
void TMR_SelectOutputTrigger(TMR_T *tmr, TMR_TRGO_SOURCE_T TRGOSource)
{
    tmr->CTRL2_B.MMSEL = TRGOSource;
}

/*!
 * @brief     Selects the Slave Mode.
 *
 * @param     tmr: The TMRx can be 1 to 12 except 6 7 10 and 11
 *
 * @param     slaveMode: specifies the Timer Slave Mode.
 *                       The parameter can be one of following values:
 *                       @arg TMR_SLAVE_MODE_RESET
 *                       @arg TMR_SLAVE_MODE_GATED
 *                       @arg TMR_SLAVE_MODE_TRIGGER
 *                       @arg TMR_SLAVE_MODE_EXTERNAL1
 *
 * @retval    None
 */
void TMR_SelectSlaveMode(TMR_T *tmr, TMR_SLAVE_MODE_T slaveMode)
{
    tmr->SMCTRL_B.SMFSEL = slaveMode;
}

/*!
 * @brief     Enable the Master Slave Mode
 *
 * @param     tmr: The TMRx can be 1 to 12 except 6 7 10 and 11
 *
 * @retval    None
 */
void TMR_EnableMasterSlaveMode(TMR_T *tmr)
{
    tmr->SMCTRL_B.MSMEN = ENABLE;
}

/*!
 * @brief     Disable the Master Slave Mode
 *
 * @param     tmr: The TMRx can be 1 to 12 except 6 7 10 and 11
 *
 * @retval    None
 */
void TMR_DisableMasterSlaveMode(TMR_T *tmr)
{
    tmr->SMCTRL_B.MSMEN = DISABLE;
}

/*!
 * @brief     Configures the TMRx External Trigger (ETR).
 *
 * @param     tmr: The TMRx can be 1 to 8 except 6 and 7
 *
 * @param     prescaler: specifies the external Trigger Prescaler
 *                       The parameter can be one of following values:
 *                       @arg TMR_EXTTRG_PSC_OFF:  ETRP Prescaler OFF
 *                       @arg TMR_EXTTRG_PSC_DIV2: ETRP frequency divided by 2
 *                       @arg TMR_EXTTRG_PSC_DIV4: ETRP frequency divided by 4
 *                       @arg TMR_EXTTRG_PSC_DIV8: ETRP frequency divided by 8
 *
 * @param     polarity: specifies the TMR IC polarity
 *                      The parameter can be one of following values:
 *                      @arg TMR_EXTTRG_POL_INVERTED:  Active low or falling edge active
 *                      @arg TMR_EXTTGR_POL_NONINVERTED: Active high or rising edge active
 *
 * @param     filter: This parameter must be a value between 0x00 and 0x0F.
 *
 * @retval    None
 */
void TMR_ConfigETR(TMR_T *tmr, TMR_EXTTRG_PSC_T prescaler,
                   TMR_EXTTRG_POL_T polarity, uint16_t filter)
{
    tmr->SMCTRL &= 0x00FF;
    tmr->SMCTRL_B.ETPCFG = prescaler;
    tmr->SMCTRL_B.ETPOL = polarity;
    tmr->SMCTRL_B.ETFCFG = filter;
}

/*!
 * @brief     Configures the Encoder Interface.
 *
 * @param     tmr: The TMRx can be 1 to 12 except 6 7 10 and 11
 *
 * @param     encodeMode: specifies the Encoder Mode
 *                        The parameter can be one of following values:
 *                        @arg TMR_ENCODER_MODE_TI1
 *                        @arg TMR_ENCODER_MODE_TI2
 *                        @arg TMR_ENCODER_MODE_TI12
 *
 * @param     IC1Polarity: specifies the TMR IC1 polarity
 *                         The parameter can be one of following values:
 *                         @arg TMR_IC_POLARITY_RISING:  TMR IC polarity rising
 *                         @arg TMR_IC_POLARITY_FALLING: TMR IC polarity falling
 *
 * @param     IC2Polarity: specifies the TMR IC2 polarity
 *                         The parameter can be one of following values:
 *                         @arg TMR_IC_POLARITY_RISING:  TMR IC polarity rising
 *                         @arg TMR_IC_POLARITY_FALLING: TMR IC polarity falling
 *
 * @retval    None
 */
void TMR_ConfigEncodeInterface(TMR_T *tmr, TMR_ENCODER_MODE_T encodeMode, TMR_IC_POLARITY_T IC1Polarity,
                               TMR_IC_POLARITY_T IC2Polarity)
{
    tmr->SMCTRL_B.SMFSEL = BIT_RESET;
    tmr->SMCTRL_B.SMFSEL = encodeMode;

    tmr->CCM1_CAPTURE_B.CC1SEL = BIT_RESET ;
    tmr->CCM1_CAPTURE_B.CC2SEL = BIT_RESET ;
    tmr->CCM1_CAPTURE_B.CC1SEL = 0x01 ;
    tmr->CCM1_CAPTURE_B.CC2SEL = 0x01 ;

    tmr->CCEN_B.CC1POL = BIT_RESET;
    tmr->CCEN_B.CC2POL = BIT_RESET;
    tmr->CCEN_B.CC1POL = IC1Polarity;
    tmr->CCEN_B.CC2POL = IC2Polarity;
}

/*!
 * @brief     Enables Hall sensor interface.
 *
 * @param     tmr: The TMRx can be 1 to 12 except 6 7 10 and 11
 *
 * @retval    None
 */
void TMR_EnableHallSensor(TMR_T *tmr)
{
    tmr->CTRL2_B.TI1SEL = ENABLE;
}

/*!
 * @brief     Disable Hall sensor interface.
 *
 * @param     tmr: The TMRx can be 1 to 12 except 6 7 10 and 11
 *
 * @retval    None
 */
void TMR_DisableHallSensor(TMR_T *tmr)
{
    tmr->CTRL2_B.TI1SEL = DISABLE;
}

/*!
 * @brief     Configures the TMR2, TMR5 and TMR11 Remapping input capabilities.
 *
 * @param     tmr: The TMRx can be 2, 5 or 11
 *
 * @param     remap: specifies the MR input remapping source.
 *                   The parameter can be one of the following values:
 *                   @arg TMR2_TMR8_TRGO     : TMR2 ITR1 input is connected to TMR8 Trigger output(default)
 *                   @arg TMR2_PTP_TRG       : TMR2 ITR1 input is connected to ETH PTP trigger output.
 *                   @arg TMR2_OTG_FSUSB_SOF : TMR2 ITR1 input is connected to OTG FS SOF.
 *                   @arg TMR2_OTG_HSUSB_SOF : TMR2 ITR1 input is connected to OTG HS SOF.
 *                   @arg TMR5_GPIO          : TMR5 CH4 input is connected to GPIO
 *                   @arg TMR5_LSI           : TMR5 CH4 input is connected to LSI clock.
 *                   @arg TMR5_LSE           : TMR5 CH4 input is connected to LSE clock.
 *                   @arg TMR5_RTC           : TMR5 CH4 input is connected to RTC Output event.
 *                   @arg TMRx_GPIO          : TMR10/11/13/14 CH1 input is connected to GPIO
 *                   @arg TMRx_RTCCLK        : TMR10/11/13/14 CH1 input is connected to RTC clock
 *                   @arg TMRx_HSECLK        : TMR10/11/13/14 CH1 input is connected to HSE clock/32
 *                   @arg TMRx_MCO           : TMR10/11/13/14 CH1 input is connected to MCO
 *
 * @retval    None
 */
void TMR_ConfigRemap(TMR_T *tmr, uint32_t remap)
{
    tmr->OPT = remap;
}

/*!
 * @brief     Enable intterupts
 *
 * @param     tmr: The TMRx can be 1 to 14
 *
 * @param     interrupt: specifies the TMR interrupts sources
 *                       The parameter can be any combination of following values:
 *                       @arg TMR_INT_UPDATE: Timer update Interrupt source
 *                       @arg TMR_INT_CC1: Timer Capture Compare 1 Interrupt source
 *                       @arg TMR_INT_CC2: Timer Capture Compare 2 Interrupt source
 *                       @arg TMR_INT_CC3: Timer Capture Compare 3 Interrupt source
 *                       @arg TMR_INT_CC4: Timer Capture Compare 4 Interrupt source
 *                       @arg TMR_INT_COM: Timer Commutation Interrupt source (Only for TMR1 and TMR8)
 *                       @arg TMR_INT_TRG: Timer Trigger Interrupt source
 *                       @arg TMR_INT_BRK: Timer Break Interrupt source (Only for TMR1 and TMR8)
 *
 * @retval    None
 *
 * @note      TMR6 and TMR7 can only generate an TMR_INT_UPDATE.
 */
void TMR_EnableInterrupt(TMR_T *tmr, uint16_t interrupt)
{
    tmr->DIEN |= interrupt;
}

/*!
 * @brief     Disable intterupts
 *
 * @param     tmr: The TMRx can be 1 to 14
 *
 * @param     interrupt: specifies the TMR interrupts sources
 *                       The parameter can be any combination of following values:
 *                       @arg TMR_INT_UPDATE: Timer update Interrupt source
 *                       @arg TMR_INT_CC1: Timer Capture Compare 1 Interrupt source
 *                       @arg TMR_INT_CC2: Timer Capture Compare 1 Interrupt source
 *                       @arg TMR_INT_CC3: Timer Capture Compare 3 Interrupt source
 *                       @arg TMR_INT_CC4: Timer Capture Compare 4 Interrupt source
 *                       @arg TMR_INT_COM: Timer Commutation Interrupt source (Only for TMR1 and TMR8)
 *                       @arg TMR_INT_TRG: Timer Trigger Interrupt source
 *                       @arg TMR_INT_BRK: Timer Break Interrupt source (Only for TMR1 and TMR8)
 *
 * @retval    None
 *
 * @note      TMR6 and TMR7 can only generate an TMR_INT_UPDATE.
 */
void TMR_DisableInterrupt(TMR_T *tmr, uint16_t interrupt)
{
    tmr->DIEN &= ~interrupt;
}

/*!
 * @brief     Configures the TMRx event to be generate by software.
 *
 * @param     tmr: The TMRx can be 1 to 14
 *
 * @param     eventSources: specifies the TMR event sources
 *                         The parameter can be any combination of following values:
 *                         @arg TMR_EVENT_UPDATE: Timer update Interrupt source
 *                         @arg TMR_EVENT_CH1: Timer Capture Compare 1 Event source
 *                         @arg TMR_EVENT_CH2: Timer Capture Compare 1 Event source
 *                         @arg TMR_EVENT_CH3: Timer Capture Compare 3 Event source
 *                         @arg TMR_EVENT_CH4: Timer Capture Compare 4 Event source
 *                         @arg TMR_EVENT_COM: Timer Commutation Event source (Only for TMR1 and TMR8)
 *                         @arg TMR_EVENT_TRG: Timer Trigger Event source
 *                         @arg TMR_EVENT_BRK: Timer Break Event source (Only for TMR1 and TMR8)
 *
 * @retval    None
 *
 * @note      TMR6 and TMR7 can only generate an TMR_EVENT_UPDATE.
 */
void TMR_GenerateEvent(TMR_T *tmr, uint16_t eventSources)
{
    tmr->CEG = eventSources;
}

/*!
 * @brief     Check whether the flag is set or reset
 *
 * @param     tmr: The TMRx can be 1 to 14
 *
 * @param     interrupt: specifies the TMR interrupts sources
 *                     The parameter can be any combination of following values:
 *                     @arg TMR_FLAG_UPDATE: Timer update Flag
 *                     @arg TMR_FLAG_CH1: Timer Capture Compare 1 Flag
 *                     @arg TMR_FLAG_CH2: Timer Capture Compare 2 Flag
 *                     @arg TMR_FLAG_CH3: Timer Capture Compare 3 Flag
 *                     @arg TMR_FLAG_CH4: Timer Capture Compare 4 Flag
 *                     @arg TMR_FLAG_COM: Timer Commutation Flag (Only for TMR1 and TMR8)
 *                     @arg TMR_FLAG_TRG: Timer Trigger Flag
 *                     @arg TMR_FLAG_BRK: Timer Break Flag (Only for TMR1 and TMR8)
 *                     @arg TMR_FLAG_CC1RC: Timer Capture Compare 1 Repetition Flag
 *                     @arg TMR_FLAG_CC2RC: Timer Capture Compare 2 Repetition Flag
 *                     @arg TMR_FLAG_CC3RC: Timer Capture Compare 3 Repetition Flag
 *            @arg TMR_FLAG_CC4RC: Timer Capture Compare 4 Repetition Flag
 *
 * @retval    None
 *
 * @note      TMR6 and TMR7 can only generate an TMR_FLAG_UPDATE.
 */
uint16_t TMR_ReadStatusFlag(TMR_T *tmr, TMR_FLAG_T flag)
{
    return (tmr->STS & flag) ? SET : RESET;
}

/*!
 * @brief     Clears the TMR's pending flags.
 *
 * @param     tmr: The TMRx can be 1 to 14
 *
 * @param     interrupt: specifies the TMR interrupts sources
 *                      The parameter can be any combination of following values:
 *                      @arg TMR_FLAG_UPDATE: Timer update Flag
 *                      @arg TMR_FLAG_CH1: Timer Capture Compare 1 Flag
 *                      @arg TMR_FLAG_CH2: Timer Capture Compare 2 Flag
 *                      @arg TMR_FLAG_CH3: Timer Capture Compare 3 Flag
 *                      @arg TMR_FLAG_CH4: Timer Capture Compare 4 Flag
 *                      @arg TMR_FLAG_COM: Timer Commutation Flag (Only for TMR1 and TMR8)
 *                      @arg TMR_FLAG_TRG: Timer Trigger Flag
 *                      @arg TMR_FLAG_BRK: Timer Break Flag (Only for TMR1 and TMR8)
 *                      @arg TMR_FLAG_CC1RC: Timer Capture Compare 1 Repetition Flag
 *                      @arg TMR_FLAG_CC2RC: Timer Capture Compare 2 Repetition Flag
 *                      @arg TMR_FLAG_CC3RC: Timer Capture Compare 3 Repetition Flag
 *                      @arg TMR_FLAG_CC4RC: Timer Capture Compare 4 Repetition Flag
 *
 * @retval    None
 *
 * @note      TMR6 and TMR7 can only generate an TMR_FLAG_UPDATE.
 */
void TMR_ClearStatusFlag(TMR_T *tmr, uint16_t flag)
{
    tmr->STS = ~flag;
}

/*!
 * @brief     Check whether the ITflag is set or reset
 *
 * @param     tmr: The TMRx can be 1 to 14
 *
 * @param     interrupt: specifies the TMR interrupts sources
 *                       The parameter can be one of following values:
 *                       @arg TMR_INT_UPDATE: Timer update Interrupt source
 *                       @arg TMR_INT_CC1: Timer Capture Compare 1 Interrupt source
 *                       @arg TMR_INT_CC2: Timer Capture Compare 1 Interrupt source
 *                       @arg TMR_INT_CC3: Timer Capture Compare 3 Interrupt source
 *                       @arg TMR_INT_CC4: Timer Capture Compare 4 Interrupt source
 *                       @arg TMR_INT_COM: Timer Commutation Interrupt source (Only for TMR1 and TMR8)
 *                       @arg TMR_INT_TRG: Timer Trigger Interrupt source
 *                       @arg TMR_INT_BRK: Timer Break Interrupt source (Only for TMR1 and TMR8)
 *
 * @retval    None
 *
 * @note      TMR6 and TMR7 can only generate an TMR_INT_UPDATE.
 */
uint16_t TMR_ReadIntFlag(TMR_T *tmr, TMR_INT_T flag)
{
    if (((tmr->STS & flag) != RESET) && ((tmr->DIEN & flag) != RESET))
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}

/*!
 * @brief     Clears the TMR's interrupt pending bits.
 *
 * @param     tmr: The TMRx can be 1 to 14
 *
 * @param     interrupt: specifies the TMR interrupts sources
 *                      The parameter can be any combination following values:
 *                      @arg TMR_INT_UPDATE: Timer update Interrupt source
 *                      @arg TMR_INT_CC1: Timer Capture Compare 1 Interrupt source
 *                      @arg TMR_INT_CC2: Timer Capture Compare 1 Interrupt source
 *                      @arg TMR_INT_CC3: Timer Capture Compare 3 Interrupt source
 *                      @arg TMR_INT_CC4: Timer Capture Compare 4 Interrupt source
 *                      @arg TMR_INT_COM: Timer Commutation Interrupt source (Only for TMR1 and TMR8)
 *                      @arg TMR_INT_TRG: Timer Trigger Interrupt source
 *                      @arg TMR_INT_BRK: Timer Break Interrupt source (Only for TMR1 and TMR8)
 *
 * @retval    None
 *
 * @note      TMR6 and TMR7 can only generate an TMR_INT_UPDATE.
 */
void TMR_ClearIntFlag(TMR_T *tmr,  uint16_t flag)
{
    tmr->STS = ~flag;
}

/*!
 * @brief     Configure the TI1 as Input
 *
 * @param     tmr: The TMRx can be 1 to 14 except 6 and 7
 *
 * @param     ICpolarity: pointer to a TMR_IC_POLARITY_T structure
 *
 * @param     ICselection: pointer to a TMR_IC_SELECTION_T structure
 *
 * @param     ICfilter: This parameter must be a value between 0x00 and 0x0F
 *
 * @retval    None
 */
static void TI1Config(TMR_T *tmr, uint16_t ICpolarity, uint16_t ICselection, uint16_t ICfilter)
{
    uint16_t tmpchctrl = 0;

    tmr->CCEN_B.CC1EN = BIT_RESET;

    tmr->CCM1_CAPTURE_B.CC1SEL = BIT_RESET;
    tmr->CCM1_CAPTURE_B.IC1F = BIT_RESET;
    tmr->CCM1_CAPTURE_B.CC1SEL = ICselection;
    tmr->CCM1_CAPTURE_B.IC1F = ICfilter;

